{"name": "[MR] MoonRanger Requirement", "children": [{"name": "[OBJ-1] Hydrogenous Volatile Measurement", "children": [{"name": "[MIS-5] Data Collection", "children": [{"name": "[SYS-9] Image Data", "children": [{"name": "[AVI-3] Image Sensors | The avionics system shall include at least X   (TBD)  image sensors with a minimum resolution of X MP (TBD)  and a minimum bit depth capability of X bits (TBD) ."}, {"name": "[AVI-15] Optics FOV | The avionics system shall include optics with a minimum horizontal field of view of X deg  at full resolution."}, {"name": "[AVI-16] Optics Filtering | The avionics system shall provide a filter to protect image sensors from ultraviolent and infrared radiation."}]}, {"name": "[SYS-18] Hydrogenous Volatile Data | The MoonRanger System shall record data from the onboard NSS payload."}, {"name": "[SYS-29] Data Logging", "children": [{"name": "[SOF-105] Receive NSS data | Moonranger software system shall receive NSS data"}, {"name": "[SOF-121] Record NSS data | Moonranger software system shall record NSS data"}, {"name": "[SOF-122] Record position estimate data | Moonranger software system shall record position estimate data"}, {"name": "[SOF-123] Record image data | Moonranger software system shall record image data"}, {"name": "[SOF-127] Calculate solar panel actuation commands | Moonranger software system will calculate solar panel actuation commands to maximise power"}, {"name": "[SOF-128] Calculate drive commands to optimise charging | Moonranger software system will calculate drive commands to optimise charging"}]}]}, {"name": "[MIS-10] Location and Pose Data Tagging", "children": [{"name": "[SYS-24] Rover Pose Estimation", "children": [{"name": "[AVI-4] Motor Sensors | The avionics system shall include motors with position sensing accurate to X (TBD) ."}, {"name": "[AVI-5] Inertial Measurement System | The avionics system shall include at least one 3-axis gyroscope and one 3-axis accelerometer accurate to X (TBD) ."}, {"name": "[SOF-103] Receive internial measurement data | Moonranger software system shall receive internial measurement data"}, {"name": "[SOF-116] Maintain a position estimate | Moonranger software system shall maintain a position estimate"}]}]}]}, {"name": "[OBJ-2] Autonomous Micro-rover", "children": [{"name": "[MIS-3] Survivability", "children": [{"name": "[SYS-2] Vibration and Shock Survivability", "children": [{"name": "[MEC-15] Internal Harnessing Integration | The structure shall mechanically integrate wire harness (for actuators, thermistors, batteries, and cameras)."}, {"name": "[MEC-34] Mechanical Structure Vibe and Shock Survivability | The structure shall survive expected vibrational and shock forces for all mission phases including launch, landing, deployment, and surface operations."}, {"name": "[AVI-25] Avionics Vibe and Shock Survivability | The avionics system shall use components that will survive expected vibrational and shock forces for all mission phases including launch, landing, deployment, and surface operations."}, {"name": "[THR-9] Thermal System Vibe and Shock Survivability | The thermal system shall use components that will survive expected vibrational and shock forces for all mission phases including launch, landing, deployment, and surface operation."}]}, {"name": "[SYS-3] Vacuum Survivability | The MoonRanger System shall survive the vacuum conditions of cis-lunar transit and the lunar surface."}, {"name": "[SYS-4] Thermal Survivability", "children": [{"name": "[MEC-16] MLI Integration | The structure shall support MLI integration."}, {"name": "[MEC-17] Radiator Sizing | The structure shall include an upwards-facing radiator with area of 0.2 m^2 +/- 0.02 m^2."}, {"name": "[MEC-33] Mechanical Structure Thermal Tolerance | The structure shall survive within -X and +Y degC (TBD) for an TBD amount of time, at a TBD rate of heat loss."}, {"name": "[SDE-9] Stowage and Deployment Thermal Operability | The stowage and deployment system shall use components that are operable within -X  and +Y deg  C (TBD)."}, {"name": "[SDE-13] Stowage and Deployment Thermal Survival | The stowage and deployment system shall use components that will survive within -X  and +Y deg C (TBD)."}, {"name": "[AVI-1] Transit Heat | The avionics system shall include a thin film heater to maintain thermal survival during transit."}, {"name": "[AVI-23] Avionics Thermal Operability | The avionics system shall use components that are operable within -10 to +35 degC for internal components and within -25 to +55 degC for external components."}, {"name": "[AVI-24] Avionics Thermal Survivability | The avionics system shall use components that survive within -15 to +40 degC for internal components and within -25 to +60 degC for external components."}, {"name": "[AVI-29] Avionics for Thermal Control | The avionics system shall provide sensing and actuation to facilitate active thermal control, both with and without computing active."}, {"name": "[SOF-101] Receive temperature sensor data | Moonranger software system shall receive temperature sensor data"}, {"name": "[SOF-113] Receive vehicle thermal parameters | Moonranger software system shall receive vehicle thermal parameters"}, {"name": "[SOF-129] Calculate drive commands | Moonranger software system will calculate drive commands to optimise thermal performance"}, {"name": "[THR-1] Survival Temperature Regulation | The thermal system shall maintain temperatures in accordance with the ThEL survival temperatures during transit and lunar surface operations without operating high-risk avionics components."}, {"name": "[THR-2] Operation Temperature Regulation | The thermal system shall maintain temperatures in accordance with the ThEL operating temperatures during transit and lunar surface operations that involve high-risk components being on."}, {"name": "[THR-5] Transit Lander Power Loss Survival | The thermal system shall maintain system temperatures in accordance with the ThEL survival temperature limits for a period of at least X hours  during periods of no lander provided power."}, {"name": "[THR-6] Surface Solar Power Loss Survival | The thermal system shall ensure system temperatures are in accordance with the ThEL survival temperature limits for a period of at least 2 hours with full battery as an initial condition during periods of no solar input power."}, {"name": "[THR-7] Temperature Monitoring | The thermal system shall measure, log, and transmit temperature data."}, {"name": "[THR-17] Thermal Model Correlation | MoonRanger shall have a thermal model that is correlated to within 5% TBR temperature accuracy"}]}, {"name": "[SYS-5] EMI/EMC Survivability", "children": [{"name": "[AVI-27] Avionics EMI/EMC Survivability | The avionics system shall use components, or shield components, such that the avionics system will survive expected EMI/EMC environments for all mission phases including launch, landing, deployment, and surface operations."}, {"name": "[THR-11] Thermal System EMI/EMC Survivability | The thermal system shall use components, or shield components, such that the thermal system will survive expected EMI/EMC environments for all mission phases including launch, landing, deployment, and surface operations."}]}, {"name": "[SYS-7] Regolith Dust Survivability", "children": [{"name": "[MEC-12] Regolith Sealing | The structure shall seal all avionics and mechanisms against lunar regolith ingress for the duration of surface operations. (TBR)"}, {"name": "[MEC-14] Operation Dust Adhesion Protection | The structure shall protect radiator TBD% nominal performance and optical surfaces TBD% nominal performance from regolith interaction during lunar landing and deployment. Should protect during surface operations."}]}, {"name": "[SYS-21] Radiation Survivability", "children": [{"name": "[AVI-26] Avionics Radiation Survivability | The avionics system shall use components, or shield components, such that the avionics system will survive expected radiation environments for all mission phases including launch, landing, deployment, and surface operations."}, {"name": "[SOF-138] Component power cycling capability | Moonranger software system will provide a component power cycling capability"}, {"name": "[THR-12] Thermal System Radiation Survivability | The thermal system shall use components, or shield components, such that the thermal system will survive expected radiation environments for all mission phases including launch, landing, deployment, and surface operations."}]}]}, {"name": "[MIS-4] Lunar Polar Navigation", "children": [{"name": "[SYS-23] Mobility", "children": [{"name": "[MEC-1] Drive Speed | The mobility system shall exhibit a maximum sustained (TBR) drive speed of at least 5.0 (TBR) cm/s and minimum controlled drive speed (TBD) of 0.05 (TBR) cm/s in flat, non-obstructed, moon-like terrain."}, {"name": "[MEC-2] Tipover Angle | The mobility system shall remain statically determinant when tipped longitudinally, laterally, and diagonally on a solid surface up to an angle of 10 deg (TBR)."}, {"name": "[MEC-4] Positive Step Obstacle | The mobility system shall surmount positive step obstacles up to 15 cm (TBR) in height while driving in obstructed moon-like terrain."}, {"name": "[MEC-6] Axial Slope | The mobility system shall axially traverse +/- 15 deg (TBR) slopes with a slippage percent of  <TBD%  during forward driving."}, {"name": "[MEC-7] Lateral Slope | The mobility system shall laterally traverse +/- 15 deg (TBR) slopes with a slippage percent of <TBD%  during forward driving."}, {"name": "[MEC-10] Turning Speed | The mobility system shall exhibit a nominal turning speed capability of 15 deg/s (TBR) in flat, non-obstructed, moon-like terrain while point turning."}, {"name": "[MEC-11] Turning Radius | The mobility system shall fully complete a point turn with a maximum radius of 20 cm (TBR)  in flat, non-obstructed, moon-like terrain in both left and right directions."}, {"name": "[MEC-3] Surface Clearance | The mobility system shall exhibit surface clearance of 10 cm (TBR) during all stages of surface operation in non-obstructed moon-like terrain."}, {"name": "[AVI-2] Motor Drivers | The avionics system shall include hardware to control and drive at least 5 actuators."}, {"name": "[SOF-111] Receive vehicle kinematic parameters | Moonranger software system shall receive vehicle kinematic parameters"}, {"name": "[SOF-112] Receive vehicle mechanical parameters | Moonranger software system shall receive vehicle mechanical parameters"}, {"name": "[SOF-114] Receive wheel velocity data | Moonranger software system shall receive wheel velocity data"}, {"name": "[SOF-139] Receive motor current data | Moonranger software system shall receive motor current data"}]}, {"name": "[SYS-28] Power Generation", "children": [{"name": "[SDE-6] Solar Panel Deployment | The stowage and deployment system shall deploy the MoonRanger solar panel to a 90 deg  (+/-X deg)(TBD)  orientation with respect to the rover vertical plane."}, {"name": "[AVI-8] Voltage Monitoring | The avionics system shall provide voltage sensing hardware across the primary battery package and the 28V, 15V, 5V, 3.3V rails."}, {"name": "[AVI-9] Overvoltage Protection | The avionics system shall provide hardware protections to prevent damage by overvoltage transients within derating limits."}, {"name": "[AVI-10] Batteries | The avionics system shall include a battery package capable of delivering >= XV at >= Y amps and >= Z mAh (TBD)."}, {"name": "[AVI-11] Charge Rate | The avionics system shall include circuits capable of recharging the battery via onboard solar panels and wired lander connection at a nominal rate of at least X V/hr (TBD)."}, {"name": "[AVI-12] Current Measurement | The avionics system shall provide current measurement hardware for each actuator to at least 4 amps."}, {"name": "[AVI-14] Solar Panel | The avionics system shall provide a solar panel that provides a minimum of 50W  at a 5 deg incidence angle  at full resolution."}, {"name": "[SOF-102] Receive sun angle sensor data | Moonranger software system shall receive sun angle sensor data"}, {"name": "[SOF-104] Receive power status data | Moonranger software system shall receive power status data"}, {"name": "[SOF-115] Receive solar panel actuator velocity data | Moonranger software system shall receive solar panel actuator velocity data"}, {"name": "[THR-4] Surface Operations Thermal Regulation Power Supply | The thermal system shall maintain temperature limits in accordance with power consumptions listed on PEL during lunar transit and surface operations."}, {"name": "[POW-2] Solar Power | The power system shall accept power from a solar panel within the bounds of the solar panel output determined by panel provider and rover power system."}, {"name": "[POW-3] Battery Capacity | The power system shall store energy at a capacity determined by mission requirements TBD."}, {"name": "[POW-4] Battery Charge Rate | The power system shall include circuits capable of recharging the battery via onboard solar panels and wired lander connection at a nominal rate of at least X V/hr (TBD)."}, {"name": "[POW-5] Battery Discharge Rate | The power system shall include circuits capable of discharging the battery via power management system at a nominal rate of at least X V/hr (TBD)."}, {"name": "[POW-6] Power Management System | The power system shall interface to rover peripheral computer, interface with lander switch control, and provide power to rover systems using a power management system."}, {"name": "[POW-7] NSS Power Requirement | The power system shall interface and provide power consistent with NSS ICD"}]}]}, {"name": "[MIS-9] Autonomy Demonstration", "children": [{"name": "[SYS-25] Autonomy", "children": [{"name": "[SOF-100] Receive camera data | Moonranger software system shall receive camera data"}, {"name": "[SOF-120] Operate out of communications range | Moonranger software system shall operate out of communications range"}, {"name": "[SOF-126] Calculate motor drive commands | Moonranger software system shall calculate motor drive commands that safely navigate vehicle to goal position"}, {"name": "[SOF-135] Create environment map | Moonranger software system shall create a virtual map of the environment"}, {"name": "[SOF-136] Unsafe terrain detection | Moonranger software system shall detect unsafe terrain"}, {"name": "[SOF-137] Transmit environment map | Moonranger software system shall transmit a map of the environment"}]}]}]}, {"name": "[OBJ-3] Flight Contract", "children": [{"name": "[MIS-1] Flight Payload", "children": [{"name": "[SYS-1] Attachment and Volume Requirements", "children": [{"name": "[MEC-20] Stowage Envelope | The structure shall stow in an envelope defined as a 65 x 68 x 34 cm (LWH) volume, with between 4 - 5 cylindrical protrusions of 40mm diameter and 55mm height above the specified box. Refer to notes for the full envelope detail."}, {"name": "[MEC-31] Mechanical Center of Mass | The structure shall have a center of mass within +/- 0.5 cm (TBR) in any direction of the center of mass used in mobility simulations"}, {"name": "[MEC-36] Mechanical Lander Deliverable Requirements | The structure shall meet the lander program deliverable requirements (such as FEA)."}, {"name": "[SDE-15] Stowed COM | The stowage and deployment system shall demonstrate a stowed MoonRanger system with a center of mass located within X cm to the ICD. (TBD)"}, {"name": "[THR-14] Thermal Lander Deliverable Requirements | The thermal system shall meet the lander program deliverable requirements (such as thermal models, FEA)."}]}, {"name": "[SYS-6] Outgassing", "children": [{"name": "[MEC-32] Outgassing | The structure shall be within outgassing standards of TML < 1.0% and CVCM < 0.1%."}, {"name": "[SDE-1] Stowage and Deployment Outgassing | The stowage and deployment system shall use components that outgas TML < 1.0% and CVCM < 0.1%."}, {"name": "[AVI-22] Avionics Outgassing | The avionics system shall use components that outgas TML < 1.0% and CVCM < 0.1%."}, {"name": "[THR-10] Thermal System Outgassing | The thermal system shall use components that outgas TML < 1.0% and CVCM < 0.1%."}]}, {"name": "[SYS-8] Physical Disengage", "children": [{"name": "[MEC-18] Rover Mounting | The structure shall mechanically incorporate mounting of (avionics, stowage and deployment, NSS and motors) into one system in compliance with Masten ICD and have launch integrity"}, {"name": "[SDE-4] Deployment Height | The stowage and deployment system shall deploy MoonRanger to the lunar surface without damage from a height of at least 1.2 m ."}, {"name": "[SDE-5] Deployment Success | The stowage and deployment system shall deploy MoonRanger upright in lunar gravity with TBD %  chance of tipover."}]}, {"name": "[SYS-12] Mass Budget", "children": [{"name": "[MEC-35] Mechanical Structure Mass | The structure shall not weigh more than X grams in accordance with the MEL. (TBD)"}, {"name": "[SDE-14] Stowage and Deployment Mass | The stowage and deployment system shall not weigh more than X grams  in accordance with the MEL. (TBD)"}, {"name": "[AVI-28] Avionics Mass | The avionics system shall weigh X (+/-Y) grams  in accordance with the MEL."}, {"name": "[THR-13] Thermal System Mass | The thermal system shall weigh X (+/- Y) grams in accordance with the MEL."}]}, {"name": "[SYS-15] Lander Isolation", "children": [{"name": "[SDE-2] Non-Pyrotechnic HDRM | The stowage and deployment system shall use a non-pyrotechnic HDRM."}, {"name": "[SDE-3] Deployment Shock | The stowage and deployment system shall actuate with less than 300g. (TBR)"}, {"name": "[THR-15] Thermal Isolation from Lander | The structure shall be thermally isolated from the Masten in compliance with Masten ICD."}]}, {"name": "[SYS-16] Lander Power in Transit", "children": [{"name": "[SDE-7] Standardized Pin Configuration | The stowage and deployment system shall comply with a standardized pin configuration approved by the host lander ICD."}, {"name": "[SDE-16] Grounding Attachment | The stowage and deployment system shall allow access to at least a single ground attachment point on the chassis for bonding purposes with the lander."}, {"name": "[SDE-17] Common Ground Bus | The stowage and deployment system shall ground the electrical elements to a common ground bus."}, {"name": "[THR-3] Transit Thermal Regulation Power Supply | The thermal system shall maintain temperature limits using less than 8W (TBR) of power during lunar transit."}, {"name": "[POW-1] Lander Power | The power system shall accept power from the lander within bounds determined by lander provider and requirements of rover power system."}]}, {"name": "[SYS-17] Lander Power Pre-Deploy", "children": [{"name": "[THR-16] Warm-up Power from Lander | The thermal system shall bring components to their operating temperatures (in accordance with the ThEL) within 1 hr after landing using no more than 18 W"}]}, {"name": "[SYS-19] Lander Power Deploy", "children": [{"name": "[SDE-8] Stowage and Deployment Power Interface | The stowage and deployment system shall deploy MoonRanger using <40W  for <60 sec  of host lander power."}]}]}, {"name": "[MIS-2] Mission Data Delivery Preparation | The MoonRanger Mission shall specify mission data product types for distribution to NASA PDS node."}, {"name": "[MIS-6] Mission Operations", "children": [{"name": "[SYS-13] State Checking", "children": [{"name": "[AVI-17] System Reset | The avionics system shall provide hardware capable of resetting critical components and recovery from faults."}, {"name": "[AVI-18] Non-Volatile Memory | The avionics system shall provide a minimum capacity of X (TBD)  non-volatile memory."}, {"name": "[SOF-117] Maintain a system health status | Moonranger software system shall maintain a system health status"}, {"name": "[SOF-118] Maintain measured temperature within component limits | Moonranger software system shall maintain measured temperature within component limits"}]}, {"name": "[MOP-1] Mission Operations Plan", "children": [{"name": "[OPR-1] Standard Operating Procedure | Mission Control operators shall have a standard operating procedure to guide operation"}, {"name": "[SOF-107] Receive goal position commands | Moonranger software system shall receive goal position commands"}, {"name": "[SOF-110] Receive environment maps | Moonranger software system will receive environment maps"}]}, {"name": "[MOP-4] Mission Control Operators", "children": [{"name": "[OPR-3] Shift Structure | Mission Control operators shall perform duties in shifts of continuous activity throughout flight phase operations"}, {"name": "[OPR-5] Backups | Each role shall have at least one backup operator in the event an operator is not present for their shift"}]}, {"name": "[MOP-5] Training", "children": [{"name": "[OPR-4] Onboarding and Preparation | Mission Control operators shall undergo a training program approved by major stakeholders"}, {"name": "[OPR-8] Teleoperation | Mission Control operators shall be able to teleoperate the rover"}, {"name": "[OPR-9] Generate Routes | Mission Control operators shall be able to generate routes to proposed waypoint locations"}]}, {"name": "[MOP-10] Public Engagement", "children": [{"name": "[FAC-11] Power | The Mission Control facility shall provide an reliable power supply with a backup plan in place."}, {"name": "[OPR-17] External Communication | Mission Control shall follow a public engagement plan during the mission's flight phase."}]}, {"name": "[MOP-14] Decision Making Process", "children": [{"name": "[OPR-2] Decision Structure | Mission Control operators shall have a decision making framework to align with mission objectives and command structure approved by major stakeholders"}]}, {"name": "[MOP-15] Stakeholder Communication", "children": [{"name": "[OPR-10] Communication with NSS\nNASA Ames Team | Mission Control operators shall follow a plan of communication with the NASA Ames NSS team, relying on the MoonRanger NSS team lead as the primar person person of contact."}, {"name": "[OPR-14] Communication with Masten | Mission Control operators shall follow a plan of communication with Masten, relying on the Masten-Liaison as the primar person person of contact."}, {"name": "[OPR-15] Communication with NASA | Mission Control operators shall follow a plan of communication with NASA program officials, relying on the MoonRanger PI's as the primary people of contact."}, {"name": "[OPR-16] Communication with Payloads | Mission Control operators shall follow a plan of communication with other Masten payload personelle, relying on TBD MoonRanger personelle as the primary people of contact."}]}, {"name": "[MOP-17] Remote Operations", "children": [{"name": "[OPR-18] Remote Operators | Mission control operating procedures shall include procedrues and details for remote operators."}, {"name": "[SOF-108] Receive teleoperation drive commands | Moonranger software system shall receive teleoperation drive commands"}, {"name": "[SOF-109] Receive information request commands | Moonranger software system will receive information request commands"}]}]}, {"name": "[MIS-7] Delivery Date | The MoonRanger Mission shall deliver a rover and chartered program documentation no later than December 2021."}, {"name": "[MIS-8] Mission Control Center", "children": [{"name": "[MOP-9] Infrastructure", "children": [{"name": "[FAC-2] Operator Equipment | All operators on-duty should have access to a keyboard, mouse, microphone, monitor(s) & computer setup, and headphones or speakers"}, {"name": "[FAC-3] Facility Layout | The Mission Control facility shall be selected and outfitted in accordance with a facility plan"}, {"name": "[FAC-4] Redundancy Plan | The Mission Control facility and operator workspaces shall be outfitted in accordance with a redundancy plan"}, {"name": "[FAC-5] All Day Access | The Mission Control facility and equipment shall be available continuously throught training, setup, and mission flight phase"}, {"name": "[FAC-8] Visual & Audio Cues | The Mission Control facility should be equipped to communicate some information visually and auditorially"}, {"name": "[FAC-9] Information | The Mission Control facility shall be equipped to communicate a defined set of information"}, {"name": "[FAC-10] Secure Connection | The Mission Control facility shall allow for a secure connection from mission control station to Masten control station"}]}, {"name": "[MOP-12] Constant Monitoring | Mission control shall command and monitor MoonRanger up to 24 hours per Earth day during the Flight Phase"}]}, {"name": "[MIS-11] Data Communication", "children": [{"name": "[SYS-10] Communications", "children": [{"name": "[AVI-13] Lander Electrical Connector | The avionics system shall include one connector for interface with the lander that is compliant with Masten ICD."}, {"name": "[AVI-19] Detect Communications Range | The avionics system shall allow for detection and measurement of the rover distance from the lander with an accuracy of +/- 2   m (TBR)."}, {"name": "[AVI-21] Lander Wired Communication | The avionics system shall establish and maintain serial connection at a minimum rate of 38.4 kbps ."}, {"name": "[SOF-119] Maintain communication connection status | Moonranger software system shall maintain communication connection status"}, {"name": "[SOF-124] Data transmission prioritization service | Moonranger software system shall provide a data transmission prioritization service"}, {"name": "[SOF-125] Data transmission verification service | Moonranger software system shall provide a data transmission verification service"}]}, {"name": "[SYS-11] Data Uplink and Downlink", "children": [{"name": "[SOF-130] Transmit position estimate data | Moonranger software system shall transmit position estimate data"}, {"name": "[SOF-131] Transmit robot health status | Moonranger software system shall transmit robot health status"}, {"name": "[SOF-132] Transmit NSS data | Moonranger software system shall transmit NSS data"}, {"name": "[SOF-133] Transmit image data | Moonranger software system shall transmit image data"}]}, {"name": "[SYS-30] Wireless Standard", "children": [{"name": "[AVI-6] Radio | The avionics system shall include a radio compliant with the IEEE 2.4 GHz 802.11n standard."}, {"name": "[AVI-7] Antenna | The avionics system shall communicate with an antenna that enables a minimum range of 80 m  to host lander."}, {"name": "[AVI-20] Detect Communications Strength | The avionics system shall detect and measure the signal strength of the wireless connection with an accuracy of X dBm  (TBD) ."}, {"name": "[SOF-106] Receive 802.1n wireless signal data | Moonranger software system shall receive 802.1n wireless signal data"}]}, {"name": "[MOP-2] Mission Control Software", "children": [{"name": "[FAC-1] Stable MCS Connection | All operators shall have access to a workspace which facilitates a X (TBD) stable internet connection to MCS servers"}, {"name": "[MCS-1] Command | Mission Control Software shall be able to command and control the rover"}, {"name": "[MCS-2] Retrieve Data | Mission Control Software shall retrieve and parse data from the lander provider"}, {"name": "[MCS-3] Visualize Data | Mission Control Software shall visualize data for Mission Control operators"}, {"name": "[MCS-4] Archive Mission Data | Mission Control Software shall archive mission data"}, {"name": "[MCS-6] Flexibility | Mission Control Software shall be easily modifiable such that changing the layout or content could be accommodated within 8-hours (TBR) of development time"}, {"name": "[MCS-7] Availability | Mission Control Software shall have high availability such that the core functionality of the software is available for 99.99% (TBR) of the mission duration"}, {"name": "[MCS-8] User-Friendly Design | Mission Control Software shall be designed intuitively such that new users can be proficient with the software within 8-hours and any desired actions can be performed within two minutes"}, {"name": "[MCS-9] Authentication | Mission Control Software shall be secure such that only authorized Mission Control operators can access the software"}, {"name": "[MCS-12] Global Planning Waypoint Selection | Mission Control Software shall provide a platform and procedure for waypoint selection during the flight phase of the mission."}, {"name": "[MCS-13] Global Planning Path Selection | Mission Control Software shall provide a platform and procedure for global path selection during the flight phase of the mission."}]}, {"name": "[MOP-3] Communication", "children": [{"name": "[FAC-6] Stable Communication | The Mission Control facility shall facilitate a stable line of communication of at least 65Mbps to and from MoonRanger & the NSS team and the Masten lander ground station"}, {"name": "[MCS-10] Data Uplink and Downlink | Mission Control Software shall be able to transmit and receive data to and from the lander via Masten at least X (TBD) Mbps ."}, {"name": "[MCS-11] Teleoperation | Mission Control Software shall be able to calculate and transmit motion commands to MoonRanger via lander via Masten"}]}, {"name": "[MOP-11] External Data Products", "children": [{"name": "[DPR-1] Image Data | MoonRanger shall produce a data product package and submit to the Planetary Data Sciences Node (PDS)"}, {"name": "[DPR-2] Trek 1 Data | MoonRanger should produce a complete package including telemetry, images, time-stamping, and position estimation data processed and packaged for PDS."}, {"name": "[DPR-3] NSS Data | MoonRanger shall package NSS data in TBR format and send to NSS NASA Ames Research Team within X TBD days of surface operation completion."}, {"name": "[DPR-4] Telemetry | MoonRanger shall produce a data product package and submit to the Planetary Data Sciences Node (PDS)"}, {"name": "[DPR-5] 3D Terrain Reconstruction | MoonRanger shall produce a data product package and submit to the Planetary Data Sciences Node (PDS)"}, {"name": "[DPR-6] Pose Estimation | MoonRanger shall produce a data product package and submit to the Planetary Data Sciences Node (PDS)"}, {"name": "[DPR-7] Science Return Package | MoonRanger should compile data products including telemetry, NSS data, pose estimation, and time-stamping to package and submit to [TBD] payloads interested in science-return drive-by."}, {"name": "[DPR-8] CMU | MoonRanger should produce and compile a package of TBR data to submit to CMU for publication in TBD format."}]}]}]}, {"name": "[OBJ-4] Regulations", "children": [{"name": "[MIS-12] Safety", "children": [{"name": "[MOP-16] Safety", "children": [{"name": "[FAC-7] Safety Plan | The Mission Control facility shall have a documented safety plan"}, {"name": "[OPR-13] Safety Protocol | Mission Control operators shall follow a safety procedures plan"}]}]}]}]}